6 семестр/КИСП/Курсовая/Greg/tools/fill-data/build/cfg-dump/Documents/ЗаявкаНаБроньБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаНаБроньБилетов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кинозал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кинозалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБилета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыБилетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фильм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фильмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБилетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

6 семестр/КИСП/Курсовая/Greg/tools/fill-data/build/cfg-dump/Documents/ЗаявкаНаБроньБилетов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РассчитатьСумму()
	Если ЗначениеЗаполнено(Объект.ТипБилета) И Объект.КоличествоБилетов > 0 Тогда
		ДанныеТипаБилета = ПолучитьДанныеТипаБилета(Объект.ТипБилета);
		Если ДанныеТипаБилета.КатегорияБилета = "ЗаБилет" Тогда
			Объект.Сумма = Объект.КоличествоБилетов * ДанныеТипаБилета.Цена;
		ИначеЕсли ДанныеТипаБилета.КатегорияБилета = "Пакет" Или ДанныеТипаБилета.КатегорияБилета = "Абонемент" Тогда
			Объект.Сумма = ДанныеТипаБилета.Цена;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеТипаБилета(ТипБилета)
	Данные = Новый Структура("КатегорияБилета, Цена");
	Данные.КатегорияБилета = ТипБилета.КатегорияБилета;
	Данные.Цена = ТипБилета.Цена;
	Возврат Данные;
КонецФункции

&НаКлиенте
Процедура ТипБилетаПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоБилетовПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура НачалоСеансаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Фильм) И ЗначениеЗаполнено(Объект.НачалоСеанса) Тогда
		Объект.ОкончаниеСеанса = Объект.НачалоСеанса + Объект.Фильм.Продолжительность * 60;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФильмПриИзменении(Элемент)
	НачалоСеансаПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеСеансаПриИзменении(Элемент)
КонецПроцедуры
